### Pandas

In [4]:
import pandas as pd

In [ ]:
#C:\Users\adars_000\Downloads\code_pandas1 (1)\examples

In [8]:

draft1 = pd.read_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\ex1.csv', sep = ',', header = None)    # Supply the file name (path)

type(draft1)

pandas.core.frame.DataFrame

In [3]:
draft1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# by default, first row of a table will be considered as a column.

In [7]:
draft2 = pd.read_table(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\test.tsv')  # Read a tsv into a DataFrame

draft2.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [9]:
parsed = pd.read_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [10]:
parsed = pd.read_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\csv_mindex.csv')
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [11]:
result = pd.read_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [12]:
result = pd.read_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\ex5.csv', na_values = ['one'])
result

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [13]:
result = pd.read_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\ex5.csv', na_values = ['one'], skiprows = [1,4])
result

  something  a   b     c   d message
0       two  5   6   NaN   8   world
1     three  9  10  11.0  12     foo

In [30]:
draft3 = pd.read_excel(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\ex1.xlsx', sheet_name = 'xyz')
# Name of sheet to read from

draft3.head(6)

   Unnamed: 0 Unnamed: 1 Unnamed: 2
0         NaN       name   roll no.
1         NaN          a          1
2         NaN          b          2
3         NaN          c          3
4         NaN          d          4
5         NaN          e          5

In [28]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url

BB_data[0].ix[:, 0:20].head(5)      # Check 5 rows (10 columns only)

C:\Users\adars_000\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """
C:\Users\adars_000\Anaconda3\lib\site-packages\pandas\core\indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,3P,3PA,3P%,2P,2PA,2P%,eFG%,FT,FTA
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,.459,18,60,.300,134,271,.494,.486,76,97
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,.407,10,25,.400,25,61,.410,.465,14,23
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,.544,0,2,.000,217,397,.547,.544,103,205
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,.432,0,0,NaN,19,44,.432,.432,22,38
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,.424,118,333,.354,257,551,.466,.491,167,198

In [5]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')  
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [7]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
chunk = pd.read_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\ex6.csv', chunksize = 1000)
chunk

In [ ]:
# 1000 in the above code means 1000 kB. this type of command helps you in extracting the chunk of data from the bigger data. 
#

In [9]:
data = pd.read_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [13]:
# we can change the separator as given below.
import sys
data.to_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\out.csv', sep = '@')

In [12]:
data.to_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\out.csv')

In [14]:
data.to_csv(sys.stdout, na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [15]:
data.to_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\out2.csv', index = False, header = False)

In [19]:
import numpy as np
np.arange(7)

array([0, 1, 2, 3, 4, 5, 6])

In [20]:
dates = pd.date_range('1/1/2020', periods = 7)
ts = pd.Series(np.arange(7), index = dates)
ts.to_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\tseries.csv')
ts

C:\Users\adars_000\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

2020-01-01    0
2020-01-02    1
2020-01-03    2
2020-01-04    3
2020-01-05    4
2020-01-06    5
2020-01-07    6
Freq: D, dtype: int32

In [21]:
import csv
f = open(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\ex7.csv')

reader = csv.reader(f)
reader

In [22]:
pd.read_csv(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\ex7.csv')

   a  b  c
0  1  2  3
1  1  2  3

In [23]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [30]:
l1 = [1,2,3,4]
l2 = [6,7,8,9]
list(zip(l1,l2))

[(1, 6), (2, 7), (3, 8), (4, 9)]

In [31]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
type(obj)

str

In [33]:
import json
result = json.loads(obj)
type(result)

dict

In [40]:
result['siblings']

[{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
 {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]

In [36]:
asjson = json.dumps(result)
type(asjson)

str

In [43]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [44]:
data = pd.read_json(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [45]:
data1 = pd.read_html(r'C:\Users\adars_000\Downloads\code_pandas1 (1)\examples\fdic_failed_bank_list.html')
data1

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]